app/controllers/keywords_controller.rb

  def show
    #accept ajax, call to Twitter API, write info to DB, then show tweets
    keyword = Keyword.create(content: params[:keyword])
    @tweets = []
    $twitter.search("#{keyword.content}", result_type: "recent").take(5).each do |tweet|
      Tweet.create(keyword_id: keyword.id, content: tweet.text, url: tweet.uri)
---
INSERT INTO "keywords" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "cat"], ["created_at", "2015-08-04 02:10:10.810570"], ["updated_at", "2015-08-04 02:10:10.810570"]]
SELECT  "keywords".* FROM "keywords"  ORDER BY "keywords"."id" DESC LIMIT 5
INSERT INTO "tweets" ("keyword_id", "content", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def keyword_tweets
    keyword = Keyword.where(content: params[:keyword]).first
    @tweets = Tweet.where(keyword_id: keyword.id)
---
SELECT  "keywords".* FROM "keywords" WHERE "keywords"."content" = ?  ORDER BY "keywords"."id" ASC LIMIT 1  [["content", "testtt"]]
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."keyword_id" = ?  ORDER BY "tweets"."id" ASC LIMIT 1  [["keyword_id", 16]]